Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS502.h
#define DCMP2LO DCMP2LO
extern volatile unsigned int  DCMP2LO __attribute__((__sfr__));
#define DCMP2HI DCMP2HI
extern volatile unsigned int  DCMP2HI __attribute__((__sfr__));
#define ADFLTR1DAT ADFLTR1DAT
extern volatile unsigned int  ADFLTR1DAT __attribute__((__sfr__));
#define ADFLTR1CON ADFLTR1CON
extern volatile unsigned int  ADFLTR1CON __attribute__((__sfr__));
__extension__ typedef struct tagADFLTR1CONBITS {
  union {
    struct {
      unsigned CHNLID:6;
      unsigned :2;
      unsigned AFRDY:1;
      unsigned AFGIEN:1;
      unsigned OVRSAM:3;
      unsigned :2;
      unsigned AFEN:1;
    };
    struct {
      unsigned CHNLID0:1;
      unsigned CHNLID1:1;
      unsigned CHNLID2:1;
      unsigned CHNLID3:1;
      unsigned CHNLID4:1;
      unsigned CHNLID5:1;
      unsigned :4;
      unsigned OVRSAM0:1;
      unsigned OVRSAM1:1;
      unsigned OVRSAM2:1;
    };
  };
} ADFLTR1CONBITS;
extern volatile ADFLTR1CONBITS ADFLTR1CONbits __attribute__((__sfr__));

#define ADFLTR2DAT ADFLTR2DAT
extern volatile unsigned int  ADFLTR2DAT __attribute__((__sfr__));
#define ADFLTR2CON ADFLTR2CON
extern volatile unsigned int  ADFLTR2CON __attribute__((__sfr__));
__extension__ typedef struct tagADFLTR2CONBITS {
  union {
    struct {
      unsigned CHNLID:6;
      unsigned :2;
      unsigned AFRDY:1;
      unsigned AFGIEN:1;
      unsigned OVRSAM:3;
      unsigned :2;
      unsigned AFEN:1;
    };
    struct {
      unsigned CHNLID0:1;
      unsigned CHNLID1:1;
      unsigned CHNLID2:1;
      unsigned CHNLID3:1;
      unsigned CHNLID4:1;
      unsigned CHNLID5:1;
      unsigned :4;
      unsigned OVRSAM0:1;
      unsigned OVRSAM1:1;
      unsigned OVRSAM2:1;
    };
  };
} ADFLTR2CONBITS;
extern volatile ADFLTR2CONBITS ADFLTR2CONbits __attribute__((__sfr__));

#define ADTRIG1 ADTRIG1
extern volatile unsigned int  ADTRIG1 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG1BITS {
  union {
    struct {
      unsigned TRGSRC0:5;
      unsigned :3;
      unsigned TRGSRC1:5;
    };
    struct {
      unsigned TRGSRC00:1;
      unsigned TRGSRC01:1;
      unsigned TRGSRC02:1;
      unsigned TRGSRC03:1;
      unsigned TRGSRC04:1;
      unsigned :3;
      unsigned TRGSRC10:1;
      unsigned TRGSRC11:1;
      unsigned TRGSRC12:1;
      unsigned TRGSRC13:1;
      unsigned TRGSRC14:1;
    };
  };
} ADTRIG1BITS;
extern volatile ADTRIG1BITS ADTRIG1bits __attribute__((__sfr__));

#define ADTRIG2 ADTRIG2
extern volatile unsigned int  ADTRIG2 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG2BITS {
  union {
    struct {
      unsigned TRGSRC2:5;
      unsigned :3;
      unsigned TRGSRC3:5;
    };
    struct {
      unsigned TRGSRC20:1;
      unsigned TRGSRC21:1;
      unsigned TRGSRC22:1;
      unsigned TRGSRC23:1;
      unsigned TRGSRC24:1;
      unsigned :3;
      unsigned TRGSRC30:1;
      unsigned TRGSRC31:1;
      unsigned TRGSRC32:1;
      unsigned TRGSRC33:1;
      unsigned TRGSRC34:1;
    };
  };
} ADTRIG2BITS;
extern volatile ADTRIG2BITS ADTRIG2bits __attribute__((__sfr__));

#define ADTRIG3 ADTRIG3
extern volatile unsigned int  ADTRIG3 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG3BITS {
  union {
    struct {
      unsigned TRGSRC4:5;
      unsigned :3;
      unsigned TRGSRC5:5;
    };
    struct {
      unsigned TRGSRC40:1;
      unsigned TRGSRC41:1;
      unsigned TRGSRC42:1;
      unsigned TRGSRC43:1;
      unsigned TRGSRC44:1;
      unsigned :3;
      unsigned TRGSRC50:1;
      unsigned TRGSRC51:1;
      unsigned TRGSRC52:1;
      unsigned TRGSRC53:1;
      unsigned TRGSRC54:1;
    };
  };
} ADTRIG3BITS;
extern volatile ADTRIG3BITS ADTRIG3bits __attribute__((__sfr__));

#define ADTRIG4 ADTRIG4
extern volatile unsigned int  ADTRIG4 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG4BITS {
  union {
    struct {
      unsigned TRGSRC6:5;
      unsigned :3;
      unsigned TRGSRC7:5;
    };
    struct {
      unsigned TRGSRC60:1;
      unsigned TRGSRC61:1;
      unsigned TRGSRC62:1;
      unsigned TRGSRC63:1;
      unsigned TRGSRC64:1;
      unsigned :3;
      unsigned TRGSRC70:1;
      unsigned TRGSRC71:1;
      unsigned TRGSRC72:1;
      unsigned TRGSRC73:1;
      unsigned TRGSRC74:1;
    };
  };
} ADTRIG4BITS;
extern volatile ADTRIG4BITS ADTRIG4bits __attribute__((__sfr__));

#define ADTRIG9 ADTRIG9
extern volatile unsigned int  ADTRIG9 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG9BITS {
  union {
    struct {
      unsigned :8;
      unsigned TRGSRC17:5;
    };
    struct {
      unsigned :8;
      unsigned TRGSRC170:1;
      unsigned TRGSRC171:1;
      unsigned TRGSRC172:1;
      unsigned TRGSRC173:1;
      unsigned TRGSRC174:1;
    };
  };
} ADTRIG9BITS;
extern volatile ADTRIG9BITS ADTRIG9bits __attribute__((__sfr__));

#define ADTRIG10 ADTRIG10
extern volatile unsigned int  ADTRIG10 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG10BITS {
  union {
    struct {
      unsigned TRGSRC18:5;
      unsigned :3;
      unsigned TRGSRC19:5;
    };
    struct {
      unsigned TRGSRC180:1;
      unsigned TRGSRC181:1;
      unsigned TRGSRC182:1;
      unsigned TRGSRC183:1;
      unsigned TRGSRC184:1;
      unsigned :3;
      unsigned TRGSRC190:1;
      unsigned TRGSRC191:1;
      unsigned TRGSRC192:1;
      unsigned TRGSRC193:1;
      unsigned TRGSRC194:1;
    };
  };
} ADTRIG10BITS;
extern volatile ADTRIG10BITS ADTRIG10bits __attribute__((__sfr__));

#define ADTRIG11 ADTRIG11
extern volatile unsigned int  ADTRIG11 __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG11BITS {
  union {
    struct {
      unsigned TRGSRC20:5;
      unsigned :3;
      unsigned TRGSRC21:5;
    };
    struct {
      unsigned TRGSRC200:1;
      unsigned TRGSRC201:1;
      unsigned TRGSRC202:1;
      unsigned TRGSRC203:1;
      unsigned TRGSRC204:1;
      unsigned :3;
      unsigned TRGSRC210:1;
      unsigned TRGSRC211:1;
      unsigned TRGSRC212:1;
      unsigned TRGSRC213:1;
      unsigned TRGSRC214:1;
    };
  };
} ADTRIG11BITS;
