Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS502.h
/* RPOR1 */
#define _RP34R RPOR1bits.RP34R
#define _RP35R RPOR1bits.RP35R
#define _RP34R0 RPOR1bits.RP34R0
#define _RP34R1 RPOR1bits.RP34R1
#define _RP34R2 RPOR1bits.RP34R2
#define _RP34R3 RPOR1bits.RP34R3
#define _RP34R4 RPOR1bits.RP34R4
#define _RP34R5 RPOR1bits.RP34R5
#define _RP35R0 RPOR1bits.RP35R0
#define _RP35R1 RPOR1bits.RP35R1
#define _RP35R2 RPOR1bits.RP35R2
#define _RP35R3 RPOR1bits.RP35R3
#define _RP35R4 RPOR1bits.RP35R4
#define _RP35R5 RPOR1bits.RP35R5

/* RPOR2 */
#define _RP36R RPOR2bits.RP36R
#define _RP37R RPOR2bits.RP37R
#define _RP36R0 RPOR2bits.RP36R0
#define _RP36R1 RPOR2bits.RP36R1
#define _RP36R2 RPOR2bits.RP36R2
#define _RP36R3 RPOR2bits.RP36R3
#define _RP36R4 RPOR2bits.RP36R4
#define _RP36R5 RPOR2bits.RP36R5
#define _RP37R0 RPOR2bits.RP37R0
#define _RP37R1 RPOR2bits.RP37R1
#define _RP37R2 RPOR2bits.RP37R2
#define _RP37R3 RPOR2bits.RP37R3
#define _RP37R4 RPOR2bits.RP37R4
#define _RP37R5 RPOR2bits.RP37R5

/* RPOR3 */
#define _RP38R RPOR3bits.RP38R
#define _RP39R RPOR3bits.RP39R
#define _RP38R0 RPOR3bits.RP38R0
#define _RP38R1 RPOR3bits.RP38R1
#define _RP38R2 RPOR3bits.RP38R2
#define _RP38R3 RPOR3bits.RP38R3
#define _RP38R4 RPOR3bits.RP38R4
#define _RP38R5 RPOR3bits.RP38R5
#define _RP39R0 RPOR3bits.RP39R0
#define _RP39R1 RPOR3bits.RP39R1
#define _RP39R2 RPOR3bits.RP39R2
#define _RP39R3 RPOR3bits.RP39R3
#define _RP39R4 RPOR3bits.RP39R4
#define _RP39R5 RPOR3bits.RP39R5

/* RPOR4 */
#define _RP40R RPOR4bits.RP40R
#define _RP41R RPOR4bits.RP41R
#define _RP40R0 RPOR4bits.RP40R0
#define _RP40R1 RPOR4bits.RP40R1
#define _RP40R2 RPOR4bits.RP40R2
#define _RP40R3 RPOR4bits.RP40R3
#define _RP40R4 RPOR4bits.RP40R4
#define _RP40R5 RPOR4bits.RP40R5
#define _RP41R0 RPOR4bits.RP41R0
#define _RP41R1 RPOR4bits.RP41R1
#define _RP41R2 RPOR4bits.RP41R2
#define _RP41R3 RPOR4bits.RP41R3
#define _RP41R4 RPOR4bits.RP41R4
#define _RP41R5 RPOR4bits.RP41R5

/* RPOR5 */
#define _RP42R RPOR5bits.RP42R
#define _RP43R RPOR5bits.RP43R
#define _RP42R0 RPOR5bits.RP42R0
#define _RP42R1 RPOR5bits.RP42R1
#define _RP42R2 RPOR5bits.RP42R2
#define _RP42R3 RPOR5bits.RP42R3
#define _RP42R4 RPOR5bits.RP42R4
#define _RP42R5 RPOR5bits.RP42R5
#define _RP43R0 RPOR5bits.RP43R0
#define _RP43R1 RPOR5bits.RP43R1
#define _RP43R2 RPOR5bits.RP43R2
#define _RP43R3 RPOR5bits.RP43R3
#define _RP43R4 RPOR5bits.RP43R4
#define _RP43R5 RPOR5bits.RP43R5

/* RPOR6 */
#define _RP44R RPOR6bits.RP44R
#define _RP45R RPOR6bits.RP45R
#define _RP44R0 RPOR6bits.RP44R0
#define _RP44R1 RPOR6bits.RP44R1
#define _RP44R2 RPOR6bits.RP44R2
#define _RP44R3 RPOR6bits.RP44R3
#define _RP44R4 RPOR6bits.RP44R4
#define _RP44R5 RPOR6bits.RP44R5
#define _RP45R0 RPOR6bits.RP45R0
#define _RP45R1 RPOR6bits.RP45R1
#define _RP45R2 RPOR6bits.RP45R2
#define _RP45R3 RPOR6bits.RP45R3
#define _RP45R4 RPOR6bits.RP45R4
#define _RP45R5 RPOR6bits.RP45R5

/* RPOR7 */
#define _RP46R RPOR7bits.RP46R
#define _RP47R RPOR7bits.RP47R
#define _RP46R0 RPOR7bits.RP46R0
#define _RP46R1 RPOR7bits.RP46R1
#define _RP46R2 RPOR7bits.RP46R2
#define _RP46R3 RPOR7bits.RP46R3
#define _RP46R4 RPOR7bits.RP46R4
#define _RP46R5 RPOR7bits.RP46R5
#define _RP47R0 RPOR7bits.RP47R0
#define _RP47R1 RPOR7bits.RP47R1
#define _RP47R2 RPOR7bits.RP47R2
#define _RP47R3 RPOR7bits.RP47R3
#define _RP47R4 RPOR7bits.RP47R4
#define _RP47R5 RPOR7bits.RP47R5

/* RPOR16 */
#define _RP176R RPOR16bits.RP176R
#define _RP177R RPOR16bits.RP177R
#define _RP176R0 RPOR16bits.RP176R0
#define _RP176R1 RPOR16bits.RP176R1
#define _RP176R2 RPOR16bits.RP176R2
#define _RP176R3 RPOR16bits.RP176R3
#define _RP176R4 RPOR16bits.RP176R4
#define _RP176R5 RPOR16bits.RP176R5
#define _RP177R0 RPOR16bits.RP177R0
#define _RP177R1 RPOR16bits.RP177R1
#define _RP177R2 RPOR16bits.RP177R2
#define _RP177R3 RPOR16bits.RP177R3
#define _RP177R4 RPOR16bits.RP177R4
#define _RP177R5 RPOR16bits.RP177R5

/* RPOR17 */
#define _RP178R RPOR17bits.RP178R
#define _RP179R RPOR17bits.RP179R
#define _RP178R0 RPOR17bits.RP178R0
#define _RP178R1 RPOR17bits.RP178R1
#define _RP178R2 RPOR17bits.RP178R2
#define _RP178R3 RPOR17bits.RP178R3
#define _RP178R4 RPOR17bits.RP178R4
#define _RP178R5 RPOR17bits.RP178R5
#define _RP179R0 RPOR17bits.RP179R0
#define _RP179R1 RPOR17bits.RP179R1
#define _RP179R2 RPOR17bits.RP179R2
#define _RP179R3 RPOR17bits.RP179R3
#define _RP179R4 RPOR17bits.RP179R4
#define _RP179R5 RPOR17bits.RP179R5

/* RPOR18 */
#define _RP180R RPOR18bits.RP180R
#define _RP181R RPOR18bits.RP181R
#define _RP180R0 RPOR18bits.RP180R0
#define _RP180R1 RPOR18bits.RP180R1
#define _RP180R2 RPOR18bits.RP180R2
#define _RP180R3 RPOR18bits.RP180R3
#define _RP180R4 RPOR18bits.RP180R4
#define _RP180R5 RPOR18bits.RP180R5
#define _RP181R0 RPOR18bits.RP181R0
#define _RP181R1 RPOR18bits.RP181R1
#define _RP181R2 RPOR18bits.RP181R2
#define _RP181R3 RPOR18bits.RP181R3
#define _RP181R4 RPOR18bits.RP181R4
#define _RP181R5 RPOR18bits.RP181R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6
#define _INT1R7 RPINR0bits.INT1R7

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT2R7 RPINR1bits.INT2R7

/* RPINR2 */
#define _T1CKRR RPINR2bits.T1CKRR
#define _T1CKRR0 RPINR2bits.T1CKRR0
#define _T1CKRR1 RPINR2bits.T1CKRR1
#define _T1CKRR2 RPINR2bits.T1CKRR2
#define _T1CKRR3 RPINR2bits.T1CKRR3
#define _T1CKRR4 RPINR2bits.T1CKRR4
#define _T1CKRR5 RPINR2bits.T1CKRR5
#define _T1CKRR6 RPINR2bits.T1CKRR6
#define _T1CKRR7 RPINR2bits.T1CKRR7

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T3CKR RPINR3bits.T3CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6
#define _T2CKR7 RPINR3bits.T2CKR7
#define _T3CKR0 RPINR3bits.T3CKR0
#define _T3CKR1 RPINR3bits.T3CKR1
#define _T3CKR2 RPINR3bits.T3CKR2
#define _T3CKR3 RPINR3bits.T3CKR3
#define _T3CKR4 RPINR3bits.T3CKR4
#define _T3CKR5 RPINR3bits.T3CKR5
#define _T3CKR6 RPINR3bits.T3CKR6
#define _T3CKR7 RPINR3bits.T3CKR7

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC2R RPINR7bits.IC2R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5
#define _IC1R6 RPINR7bits.IC1R6
#define _IC1R7 RPINR7bits.IC1R7
#define _IC2R0 RPINR7bits.IC2R0
#define _IC2R1 RPINR7bits.IC2R1
#define _IC2R2 RPINR7bits.IC2R2
#define _IC2R3 RPINR7bits.IC2R3
#define _IC2R4 RPINR7bits.IC2R4
#define _IC2R5 RPINR7bits.IC2R5
#define _IC2R6 RPINR7bits.IC2R6
#define _IC2R7 RPINR7bits.IC2R7

/* RPINR8 */
#define _IC3R RPINR8bits.IC3R
#define _IC4R RPINR8bits.IC4R
#define _IC3R0 RPINR8bits.IC3R0
#define _IC3R1 RPINR8bits.IC3R1
#define _IC3R2 RPINR8bits.IC3R2
#define _IC3R3 RPINR8bits.IC3R3
#define _IC3R4 RPINR8bits.IC3R4
#define _IC3R5 RPINR8bits.IC3R5
#define _IC3R6 RPINR8bits.IC3R6
#define _IC3R7 RPINR8bits.IC3R7
#define _IC4R0 RPINR8bits.IC4R0
#define _IC4R1 RPINR8bits.IC4R1
#define _IC4R2 RPINR8bits.IC4R2
#define _IC4R3 RPINR8bits.IC4R3
#define _IC4R4 RPINR8bits.IC4R4
#define _IC4R5 RPINR8bits.IC4R5
#define _IC4R6 RPINR8bits.IC4R6
#define _IC4R7 RPINR8bits.IC4R7

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5
#define _OCFAR6 RPINR11bits.OCFAR6
#define _OCFAR7 RPINR11bits.OCFAR7

