Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS502.h
#define _ADCSSL_CSS7_POSITION                    0x00000007
#define _ADCSSL_CSS7_MASK                        0x00000080
#define _ADCSSL_CSS7_LENGTH                      0x00000001

#define _ADCSSH_CSS17_POSITION                   0x00000001
#define _ADCSSH_CSS17_MASK                       0x00000002
#define _ADCSSH_CSS17_LENGTH                     0x00000001

#define _ADCSSH_CSS18_POSITION                   0x00000002
#define _ADCSSH_CSS18_MASK                       0x00000004
#define _ADCSSH_CSS18_LENGTH                     0x00000001

#define _ADCSSH_CSS19_POSITION                   0x00000003
#define _ADCSSH_CSS19_MASK                       0x00000008
#define _ADCSSH_CSS19_LENGTH                     0x00000001

#define _ADCSSH_CSS20_POSITION                   0x00000004
#define _ADCSSH_CSS20_MASK                       0x00000010
#define _ADCSSH_CSS20_LENGTH                     0x00000001

#define _ADCSSH_CSS21_POSITION                   0x00000005
#define _ADCSSH_CSS21_MASK                       0x00000020
#define _ADCSSH_CSS21_LENGTH                     0x00000001

#define _ADCSSH_CSS25_POSITION                   0x00000009
#define _ADCSSH_CSS25_MASK                       0x00000200
#define _ADCSSH_CSS25_LENGTH                     0x00000001

#define _ADCSSH_CSS26_POSITION                   0x0000000A
#define _ADCSSH_CSS26_MASK                       0x00000400
#define _ADCSSH_CSS26_LENGTH                     0x00000001

#define _ADSTATL_AN0RDY_POSITION                 0x00000000
#define _ADSTATL_AN0RDY_MASK                     0x00000001
#define _ADSTATL_AN0RDY_LENGTH                   0x00000001

#define _ADSTATL_AN1RDY_POSITION                 0x00000001
#define _ADSTATL_AN1RDY_MASK                     0x00000002
#define _ADSTATL_AN1RDY_LENGTH                   0x00000001

#define _ADSTATL_AN2RDY_POSITION                 0x00000002
#define _ADSTATL_AN2RDY_MASK                     0x00000004
#define _ADSTATL_AN2RDY_LENGTH                   0x00000001

#define _ADSTATL_AN3RDY_POSITION                 0x00000003
#define _ADSTATL_AN3RDY_MASK                     0x00000008
#define _ADSTATL_AN3RDY_LENGTH                   0x00000001

#define _ADSTATL_AN4RDY_POSITION                 0x00000004
#define _ADSTATL_AN4RDY_MASK                     0x00000010
#define _ADSTATL_AN4RDY_LENGTH                   0x00000001

#define _ADSTATL_AN5RDY_POSITION                 0x00000005
#define _ADSTATL_AN5RDY_MASK                     0x00000020
#define _ADSTATL_AN5RDY_LENGTH                   0x00000001

#define _ADSTATL_AN6RDY_POSITION                 0x00000006
#define _ADSTATL_AN6RDY_MASK                     0x00000040
#define _ADSTATL_AN6RDY_LENGTH                   0x00000001

#define _ADSTATL_AN7RDY_POSITION                 0x00000007
#define _ADSTATL_AN7RDY_MASK                     0x00000080
#define _ADSTATL_AN7RDY_LENGTH                   0x00000001

#define _ADSTATH_AN17RDY_POSITION                0x00000001
#define _ADSTATH_AN17RDY_MASK                    0x00000002
#define _ADSTATH_AN17RDY_LENGTH                  0x00000001

#define _ADSTATH_AN18RDY_POSITION                0x00000002
#define _ADSTATH_AN18RDY_MASK                    0x00000004
#define _ADSTATH_AN18RDY_LENGTH                  0x00000001

#define _ADSTATH_AN19RDY_POSITION                0x00000003
#define _ADSTATH_AN19RDY_MASK                    0x00000008
#define _ADSTATH_AN19RDY_LENGTH                  0x00000001

#define _ADSTATH_AN20RDY_POSITION                0x00000004
#define _ADSTATH_AN20RDY_MASK                    0x00000010
#define _ADSTATH_AN20RDY_LENGTH                  0x00000001

#define _ADSTATH_AN21RDY_POSITION                0x00000005
#define _ADSTATH_AN21RDY_MASK                    0x00000020
#define _ADSTATH_AN21RDY_LENGTH                  0x00000001

#define _ADSTATH_AN25RDY_POSITION                0x00000009
#define _ADSTATH_AN25RDY_MASK                    0x00000200
#define _ADSTATH_AN25RDY_LENGTH                  0x00000001

#define _ADSTATH_AN26RDY_POSITION                0x0000000A
#define _ADSTATH_AN26RDY_MASK                    0x00000400
#define _ADSTATH_AN26RDY_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN0_POSITION                0x00000000
#define _DCMP1ENL_CMPEN0_MASK                    0x00000001
#define _DCMP1ENL_CMPEN0_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN1_POSITION                0x00000001
#define _DCMP1ENL_CMPEN1_MASK                    0x00000002
#define _DCMP1ENL_CMPEN1_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN2_POSITION                0x00000002
#define _DCMP1ENL_CMPEN2_MASK                    0x00000004
#define _DCMP1ENL_CMPEN2_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN3_POSITION                0x00000003
#define _DCMP1ENL_CMPEN3_MASK                    0x00000008
#define _DCMP1ENL_CMPEN3_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN4_POSITION                0x00000004
#define _DCMP1ENL_CMPEN4_MASK                    0x00000010
#define _DCMP1ENL_CMPEN4_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN5_POSITION                0x00000005
#define _DCMP1ENL_CMPEN5_MASK                    0x00000020
#define _DCMP1ENL_CMPEN5_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN6_POSITION                0x00000006
#define _DCMP1ENL_CMPEN6_MASK                    0x00000040
#define _DCMP1ENL_CMPEN6_LENGTH                  0x00000001

#define _DCMP1ENL_CMPEN7_POSITION                0x00000007
#define _DCMP1ENL_CMPEN7_MASK                    0x00000080
#define _DCMP1ENL_CMPEN7_LENGTH                  0x00000001

#define _DCMP1ENH_CMPEN17_POSITION               0x00000001
#define _DCMP1ENH_CMPEN17_MASK                   0x00000002
#define _DCMP1ENH_CMPEN17_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN18_POSITION               0x00000002
#define _DCMP1ENH_CMPEN18_MASK                   0x00000004
#define _DCMP1ENH_CMPEN18_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN19_POSITION               0x00000003
#define _DCMP1ENH_CMPEN19_MASK                   0x00000008
#define _DCMP1ENH_CMPEN19_LENGTH                 0x00000001

#define _DCMP1ENH_CMPEN20_POSITION               0x00000004
#define _DCMP1ENH_CMPEN20_MASK                   0x00000010
#define _DCMP1ENH_CMPEN20_LENGTH                 0x00000001

