Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS502.h
#define _ADTRIG3_TRGSRC53_POSITION               0x0000000B
#define _ADTRIG3_TRGSRC53_MASK                   0x00000800
#define _ADTRIG3_TRGSRC53_LENGTH                 0x00000001

#define _ADTRIG3_TRGSRC54_POSITION               0x0000000C
#define _ADTRIG3_TRGSRC54_MASK                   0x00001000
#define _ADTRIG3_TRGSRC54_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC6_POSITION                0x00000000
#define _ADTRIG4_TRGSRC6_MASK                    0x0000001F
#define _ADTRIG4_TRGSRC6_LENGTH                  0x00000005

#define _ADTRIG4_TRGSRC7_POSITION                0x00000008
#define _ADTRIG4_TRGSRC7_MASK                    0x00001F00
#define _ADTRIG4_TRGSRC7_LENGTH                  0x00000005

#define _ADTRIG4_TRGSRC60_POSITION               0x00000000
#define _ADTRIG4_TRGSRC60_MASK                   0x00000001
#define _ADTRIG4_TRGSRC60_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC61_POSITION               0x00000001
#define _ADTRIG4_TRGSRC61_MASK                   0x00000002
#define _ADTRIG4_TRGSRC61_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC62_POSITION               0x00000002
#define _ADTRIG4_TRGSRC62_MASK                   0x00000004
#define _ADTRIG4_TRGSRC62_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC63_POSITION               0x00000003
#define _ADTRIG4_TRGSRC63_MASK                   0x00000008
#define _ADTRIG4_TRGSRC63_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC64_POSITION               0x00000004
#define _ADTRIG4_TRGSRC64_MASK                   0x00000010
#define _ADTRIG4_TRGSRC64_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC70_POSITION               0x00000008
#define _ADTRIG4_TRGSRC70_MASK                   0x00000100
#define _ADTRIG4_TRGSRC70_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC71_POSITION               0x00000009
#define _ADTRIG4_TRGSRC71_MASK                   0x00000200
#define _ADTRIG4_TRGSRC71_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC72_POSITION               0x0000000A
#define _ADTRIG4_TRGSRC72_MASK                   0x00000400
#define _ADTRIG4_TRGSRC72_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC73_POSITION               0x0000000B
#define _ADTRIG4_TRGSRC73_MASK                   0x00000800
#define _ADTRIG4_TRGSRC73_LENGTH                 0x00000001

#define _ADTRIG4_TRGSRC74_POSITION               0x0000000C
#define _ADTRIG4_TRGSRC74_MASK                   0x00001000
#define _ADTRIG4_TRGSRC74_LENGTH                 0x00000001

#define _ADTRIG9_TRGSRC17_POSITION               0x00000008
#define _ADTRIG9_TRGSRC17_MASK                   0x00001F00
#define _ADTRIG9_TRGSRC17_LENGTH                 0x00000005

#define _ADTRIG9_TRGSRC170_POSITION              0x00000008
#define _ADTRIG9_TRGSRC170_MASK                  0x00000100
#define _ADTRIG9_TRGSRC170_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC171_POSITION              0x00000009
#define _ADTRIG9_TRGSRC171_MASK                  0x00000200
#define _ADTRIG9_TRGSRC171_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC172_POSITION              0x0000000A
#define _ADTRIG9_TRGSRC172_MASK                  0x00000400
#define _ADTRIG9_TRGSRC172_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC173_POSITION              0x0000000B
#define _ADTRIG9_TRGSRC173_MASK                  0x00000800
#define _ADTRIG9_TRGSRC173_LENGTH                0x00000001

#define _ADTRIG9_TRGSRC174_POSITION              0x0000000C
#define _ADTRIG9_TRGSRC174_MASK                  0x00001000
#define _ADTRIG9_TRGSRC174_LENGTH                0x00000001

#define _ADTRIG10_TRGSRC18_POSITION              0x00000000
#define _ADTRIG10_TRGSRC18_MASK                  0x0000001F
#define _ADTRIG10_TRGSRC18_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC19_POSITION              0x00000008
#define _ADTRIG10_TRGSRC19_MASK                  0x00001F00
#define _ADTRIG10_TRGSRC19_LENGTH                0x00000005

#define _ADTRIG10_TRGSRC180_POSITION             0x00000000
#define _ADTRIG10_TRGSRC180_MASK                 0x00000001
#define _ADTRIG10_TRGSRC180_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC181_POSITION             0x00000001
#define _ADTRIG10_TRGSRC181_MASK                 0x00000002
#define _ADTRIG10_TRGSRC181_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC182_POSITION             0x00000002
#define _ADTRIG10_TRGSRC182_MASK                 0x00000004
#define _ADTRIG10_TRGSRC182_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC183_POSITION             0x00000003
#define _ADTRIG10_TRGSRC183_MASK                 0x00000008
#define _ADTRIG10_TRGSRC183_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC184_POSITION             0x00000004
#define _ADTRIG10_TRGSRC184_MASK                 0x00000010
#define _ADTRIG10_TRGSRC184_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC190_POSITION             0x00000008
#define _ADTRIG10_TRGSRC190_MASK                 0x00000100
#define _ADTRIG10_TRGSRC190_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC191_POSITION             0x00000009
#define _ADTRIG10_TRGSRC191_MASK                 0x00000200
#define _ADTRIG10_TRGSRC191_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC192_POSITION             0x0000000A
#define _ADTRIG10_TRGSRC192_MASK                 0x00000400
#define _ADTRIG10_TRGSRC192_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC193_POSITION             0x0000000B
#define _ADTRIG10_TRGSRC193_MASK                 0x00000800
#define _ADTRIG10_TRGSRC193_LENGTH               0x00000001

#define _ADTRIG10_TRGSRC194_POSITION             0x0000000C
#define _ADTRIG10_TRGSRC194_MASK                 0x00001000
#define _ADTRIG10_TRGSRC194_LENGTH               0x00000001

#define _ADTRIG11_TRGSRC20_POSITION              0x00000000
#define _ADTRIG11_TRGSRC20_MASK                  0x0000001F
#define _ADTRIG11_TRGSRC20_LENGTH                0x00000005

#define _ADTRIG11_TRGSRC21_POSITION              0x00000008
#define _ADTRIG11_TRGSRC21_MASK                  0x00001F00
#define _ADTRIG11_TRGSRC21_LENGTH                0x00000005

#define _ADTRIG11_TRGSRC200_POSITION             0x00000000
#define _ADTRIG11_TRGSRC200_MASK                 0x00000001
#define _ADTRIG11_TRGSRC200_LENGTH               0x00000001

