Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP32GS502.h
#define _DCMP1CON_AINID4_POSITION                0x0000000C
#define _DCMP1CON_AINID4_MASK                    0x00001000
#define _DCMP1CON_AINID4_LENGTH                  0x00000001

#define _DCMP2CON_IELOLO_POSITION                0x00000000
#define _DCMP2CON_IELOLO_MASK                    0x00000001
#define _DCMP2CON_IELOLO_LENGTH                  0x00000001

#define _DCMP2CON_IELOHI_POSITION                0x00000001
#define _DCMP2CON_IELOHI_MASK                    0x00000002
#define _DCMP2CON_IELOHI_LENGTH                  0x00000001

#define _DCMP2CON_IEHILO_POSITION                0x00000002
#define _DCMP2CON_IEHILO_MASK                    0x00000004
#define _DCMP2CON_IEHILO_LENGTH                  0x00000001

#define _DCMP2CON_IEHIHI_POSITION                0x00000003
#define _DCMP2CON_IEHIHI_MASK                    0x00000008
#define _DCMP2CON_IEHIHI_LENGTH                  0x00000001

#define _DCMP2CON_IEBTWN_POSITION                0x00000004
#define _DCMP2CON_IEBTWN_MASK                    0x00000010
#define _DCMP2CON_IEBTWN_LENGTH                  0x00000001

#define _DCMP2CON_DCMPED_POSITION                0x00000005
#define _DCMP2CON_DCMPED_MASK                    0x00000020
#define _DCMP2CON_DCMPED_LENGTH                  0x00000001

#define _DCMP2CON_DCMPGIEN_POSITION              0x00000006
#define _DCMP2CON_DCMPGIEN_MASK                  0x00000040
#define _DCMP2CON_DCMPGIEN_LENGTH                0x00000001

#define _DCMP2CON_DCMPEN_POSITION                0x00000007
#define _DCMP2CON_DCMPEN_MASK                    0x00000080
#define _DCMP2CON_DCMPEN_LENGTH                  0x00000001

#define _DCMP2CON_AINID_POSITION                 0x00000008
#define _DCMP2CON_AINID_MASK                     0x00001F00
#define _DCMP2CON_AINID_LENGTH                   0x00000005

#define _DCMP2CON_AINID0_POSITION                0x00000008
#define _DCMP2CON_AINID0_MASK                    0x00000100
#define _DCMP2CON_AINID0_LENGTH                  0x00000001

#define _DCMP2CON_AINID1_POSITION                0x00000009
#define _DCMP2CON_AINID1_MASK                    0x00000200
#define _DCMP2CON_AINID1_LENGTH                  0x00000001

#define _DCMP2CON_AINID2_POSITION                0x0000000A
#define _DCMP2CON_AINID2_MASK                    0x00000400
#define _DCMP2CON_AINID2_LENGTH                  0x00000001

#define _DCMP2CON_AINID3_POSITION                0x0000000B
#define _DCMP2CON_AINID3_MASK                    0x00000800
#define _DCMP2CON_AINID3_LENGTH                  0x00000001

#define _DCMP2CON_AINID4_POSITION                0x0000000C
#define _DCMP2CON_AINID4_MASK                    0x00001000
#define _DCMP2CON_AINID4_LENGTH                  0x00000001

#define _ISRCCON_ISRCCAL_POSITION                0x00000000
#define _ISRCCON_ISRCCAL_MASK                    0x0000003F
#define _ISRCCON_ISRCCAL_LENGTH                  0x00000006

#define _ISRCCON_OUTSEL_POSITION                 0x00000008
#define _ISRCCON_OUTSEL_MASK                     0x00000700
#define _ISRCCON_OUTSEL_LENGTH                   0x00000003

#define _ISRCCON_ISRCEN_POSITION                 0x0000000F
#define _ISRCCON_ISRCEN_MASK                     0x00008000
#define _ISRCCON_ISRCEN_LENGTH                   0x00000001

#define _ISRCCON_ISRCCAL0_POSITION               0x00000000
#define _ISRCCON_ISRCCAL0_MASK                   0x00000001
#define _ISRCCON_ISRCCAL0_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL1_POSITION               0x00000001
#define _ISRCCON_ISRCCAL1_MASK                   0x00000002
#define _ISRCCON_ISRCCAL1_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL2_POSITION               0x00000002
#define _ISRCCON_ISRCCAL2_MASK                   0x00000004
#define _ISRCCON_ISRCCAL2_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL3_POSITION               0x00000003
#define _ISRCCON_ISRCCAL3_MASK                   0x00000008
#define _ISRCCON_ISRCCAL3_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL4_POSITION               0x00000004
#define _ISRCCON_ISRCCAL4_MASK                   0x00000010
#define _ISRCCON_ISRCCAL4_LENGTH                 0x00000001

#define _ISRCCON_ISRCCAL5_POSITION               0x00000005
#define _ISRCCON_ISRCCAL5_MASK                   0x00000020
#define _ISRCCON_ISRCCAL5_LENGTH                 0x00000001

#define _ISRCCON_OUTSEL0_POSITION                0x00000008
#define _ISRCCON_OUTSEL0_MASK                    0x00000100
#define _ISRCCON_OUTSEL0_LENGTH                  0x00000001

#define _ISRCCON_OUTSEL1_POSITION                0x00000009
#define _ISRCCON_OUTSEL1_MASK                    0x00000200
#define _ISRCCON_OUTSEL1_LENGTH                  0x00000001

#define _ISRCCON_OUTSEL2_POSITION                0x0000000A
#define _ISRCCON_OUTSEL2_MASK                    0x00000400
#define _ISRCCON_OUTSEL2_LENGTH                  0x00000001

#define _PGA1CON_GAIN_POSITION                   0x00000000
#define _PGA1CON_GAIN_MASK                       0x00000007
#define _PGA1CON_GAIN_LENGTH                     0x00000003

#define _PGA1CON_SELNI_POSITION                  0x00000008
#define _PGA1CON_SELNI_MASK                      0x00000700
#define _PGA1CON_SELNI_LENGTH                    0x00000003

#define _PGA1CON_SELPI_POSITION                  0x0000000B
#define _PGA1CON_SELPI_MASK                      0x00003800
#define _PGA1CON_SELPI_LENGTH                    0x00000003

#define _PGA1CON_PGAOEN_POSITION                 0x0000000E
#define _PGA1CON_PGAOEN_MASK                     0x00004000
#define _PGA1CON_PGAOEN_LENGTH                   0x00000001

#define _PGA1CON_PGAEN_POSITION                  0x0000000F
#define _PGA1CON_PGAEN_MASK                      0x00008000
#define _PGA1CON_PGAEN_LENGTH                    0x00000001

#define _PGA1CON_GAIN0_POSITION                  0x00000000
#define _PGA1CON_GAIN0_MASK                      0x00000001
#define _PGA1CON_GAIN0_LENGTH                    0x00000001

#define _PGA1CON_GAIN1_POSITION                  0x00000001
#define _PGA1CON_GAIN1_MASK                      0x00000002
#define _PGA1CON_GAIN1_LENGTH                    0x00000001

#define _PGA1CON_GAIN2_POSITION                  0x00000002
#define _PGA1CON_GAIN2_MASK                      0x00000004
#define _PGA1CON_GAIN2_LENGTH                    0x00000001

#define _PGA1CON_SELNI0_POSITION                 0x00000008
#define _PGA1CON_SELNI0_MASK                     0x00000100
#define _PGA1CON_SELNI0_LENGTH                   0x00000001

